require "arabic/version"

module Arabic
  CHARACTER_TABLE = {
    :arabic => {
      # Numbers
      "٠" => "0",
      "١" => "1",
      "٢" => "2",
      "٣" => "3",
      "٤" => "4",
      "٥" => "5",
      "٦" => "6",
      "٧" => "7",
      "۸" => "8",
      "٩" => "9",
      # Punctuation
      "،" => ",",
      "؛" => ";",
      "؟" => "?",
      # Consonants (Letters of the Alphabet)
      "ء" => "e",
      "آ" => "a",
      "أ" => "a",
      "ؤ" => "w",
      "إ" => "i",
      "ئ" => "y",
      "ا" => "a",
      "ب" => "b",
      "ة" => "t",
      "ت" => "t",
      "ث" => "th",
      "ج" => "j",
      "ح" => "h",
      "خ" => "kh",
      "د" => "d",
      "ذ" => "dh",
      "ر" => "r",
      "ز" => "z",
      "س" => "s",
      "ش" => "sh",
      "ص" => "s",
      "ض" => "d",
      "ط" => "t",
      "ظ" => "z",
      "ع" => "e",
      "غ" => "gh",
      "ف" => "f",
      "ق" => "q",
      "ك" => "k",
      "ل" => "l",
      "م" => "m",
      "ن" => "n",
      "ه" => "h",
      "و" => "w",
      "ى" => "a",
      "ي" => "y",
      "و‎" => "u",
      # Vowels and Diphthongs
      "َ‎"  => "a",
      "ُ"  => "u",
      "ِ‎"  => "i"
    },
    :urdu => {
      # Numbers
      "٠" => "0",
      "١" => "1",
      "٢" => "2",
      "٣" => "3",
      "٤" => "4",
      "٥" => "5",
      "٦" => "6",
      "٧" => "7",
      "۸" => "8",
      "٩" => "9",
      # Punctuation
      "،" => ",",
      "؛" => ";",
      "؟" => "?",
      # Consonants (Letters of the Alphabet)
      "ا" => "a",
      "ب" => "b",
      "پ" => "p",
      "ت" => "t",
      "ٹ" => "ṭ",
      "ث" => "th",
      "ج" => "j",
      "چ" => "h",
      "خ" => "kh",
      "د" => "d",
      "ڈ" => "ḍ",
      "ذ" => "dh",
      "ر" => "r",
      "ڑ" => "ṛ",
      "ز" => "z",
      "ژ" => "zh",
      "س" => "s",
      "ش" => "sh",
      "ص" => "ṣ",
      "ض" => "z̤",
      "ط" => "t",
      "ظ" => "ẓ",
      "ع" => "'",
      "غ" => "gh",
      "ف" => "f",
      "ق" => "q",
      "ک" => "k",
      "گ" => "g",
      "ل" => "l",
      "م" => "m",
      "ن" => "n",
      "و" => "ū",
      "ﮨ" => "h",
      "ﮩ" => "h",
      "ہ" => "h",
      "ھ" => "h",
      "ء" => "'",
      "ی" => "i",
      "ے" => "e"
    }
  }

  class << self
    def transliterate(string="", lang=:arabic)
      string.to_s.gsub(Regexp.union(CHARACTER_TABLE[lang].keys.map(&:to_s)), CHARACTER_TABLE[lang])
    end
    alias_method :t, :transliterate
  end

end
